{
    "common": {
        "name": "fb-checkpresence",
        "version": "0.3.0",
        "news": {
            "0.3.0": {
                "en": "Documentation optimized\\nlastVal and json table error fixed\\nconnection type added\\ndefault value ipaddress and dateformat changed\\nnew feature fb-devices added\\nerror messages optimized\\n getDeviceInfo failure fixed",
                "de": "Dokumentation optimiert \\ nlastVal- und json-Tabellenfehler behoben \\ nVerbindungstyp hinzugefügt \\ nStandardwert IP-Adresse und Datumsformat geändert \\ nNeue Funktion fb-Geräte hinzugefügt \\ Fehlermeldungen optimiert \\ n Fehler bei getDeviceInfo behoben",
                "ru": "Оптимизирована документация \\ nlastVal и исправлена ошибка в таблице json \\ n Добавлен тип соединения \\ nЗначение по умолчанию ipaddress и dateformat изменено \\ n Добавлена новая функция fb-устройств \\ Оптимизированы сообщения об ошибках \\ n Исправлена ошибка getDeviceInfo",
                "pt": "Documentação otimizada \\ nlastVal e erro da tabela json corrigida \\ tipo de conexão adicionado \\ n valor padrão endereço de ip e formato de data alterados \\ novo novo recurso fb-devices added \\ mensagens de erro otimizadas \\ n falha de getDeviceInfo corrigida",
                "nl": "Documentatie geoptimaliseerd \\ nlastVal en json table error fixed \\ nverbindingstype toegevoegd \\ ndefault waarde ipadres en dateformaat gewijzigd \\ nnieuwe functie fb-apparaten toegevoegd \\ nfoutmeldingen geoptimaliseerd \\ n getDeviceInfo fout opgelost",
                "fr": "Documentation optimisée \\ nlastVal et erreur de table json corrigée \\ ntype de connexion ajouté \\ n valeur par défaut ipaddress et dateformat modifiés \\ nnouvelle fonctionnalité fb-devices ajoutés \\ nmessages d'erreur optimisés \\ n échec de getDeviceInfo corrigé",
                "it": "Documentazione ottimizzata \\ nlastVal errore della tabella json e riparata \\ tipo di connessione aggiunto \\ valore predefinito ipaddress e dataformat modificati \\ nuova funzionalità fb-devices aggiunti \\ messaggi nerror ottimizzati \\ n errore getDeviceInfo fisso",
                "es": "Documentación optimizada \\ nlastVal y error de tabla json corregido \\ n tipo de conexión agregado \\ n valor predeterminado ipaddress y fechaformat cambiado \\ nnueva característica fb-devices agregados \\ nerror mensajes optimizados \\ n getDeviceInfo fallo corregido",
                "pl": "Zoptymalizowana dokumentacja \\ n Błąd tabeli Vlast i Json naprawiony \\ n Dodano typ połączenia \\ n Wartość domyślna ipaddress i dataformat zmieniono \\ nnowa funkcja Dodano urządzenia fb \\ n Zoptymalizowano komunikaty o błędach \\ n naprawiono błąd getDeviceInfo",
                "zh-cn": "文档已优化\\ nlastVal和json表错误已修复\\ n已添加连接类型\\ n默认值ipaddress和dateformat已更改\\ n已添加新功能fb设备\\ n已优化错误消息\\ n已修复getDeviceInfo故障"
            },
            "0.2.2": {
                "en": "outdated packages updated, documentation changed, dependency history removed, onstate/objectChange removed, scheduler library removed, ...",
                "de": "veraltete Pakete aktualisiert, Dokumentation geändert, Abhängigkeitsverlauf entfernt, onstate / objectChange entfernt, Scheduler-Bibliothek entfernt, ...",
                "ru": "обновлены устаревшие пакеты, изменена документация, удалена история зависимостей, удалено onstate / objectChange, удалена библиотека планировщика, ...",
                "pt": "pacotes desatualizados atualizados, documentação alterada, histórico de dependências removido, onstate / objectChange removido, biblioteca do agendador removida, ...",
                "nl": "verouderde pakketten bijgewerkt, documentatie gewijzigd, afhankelijkheidshistorie verwijderd, status / objectVeranderen verwijderd, plannerbibliotheek verwijderd, ...",
                "fr": "paquets obsolètes mis à jour, documentation modifiée, historique des dépendances supprimé, onstate / objectChange supprimé, bibliothèque de planificateur supprimée, ...",
                "it": "pacchetti obsoleti aggiornati, documentazione modificata, cronologia delle dipendenze rimossa, onstate / objectChange rimosso, libreria scheduler rimossa, ...",
                "es": "paquetes obsoletos actualizados, documentación modificada, historial de dependencias eliminado, onstate / objectChange eliminado, biblioteca del planificador eliminada, ...",
                "pl": "zaktualizowano nieaktualne pakiety, zmieniono dokumentację, usunięto historię zależności, usunięto onstate / objectChange, usunięto bibliotekę harmonogramu, ...",
                "zh-cn": "更新了过时的程序包，更改了文档，删除了依赖关系历史记录，删除了onstate / objectChange，删除了调度程序库，..."
            },
            "0.2.1": {
                "en": "getGuests issue resolved, lastVal function and debug information optimized",
                "de": "Problem mit getGuests behoben, Funktion lastVal und Debug-Informationen optimiert",
                "ru": "Решена проблема с getGhest, оптимизирована функция lastVal и отладочная информация",
                "pt": "Problema getGuests resolvido, função lastVal e informações de depuração otimizadas",
                "nl": "getGuests-probleem opgelost, lastVal-functie en foutopsporingsinformatie geoptimaliseerd",
                "fr": "Problème getGuests résolu, fonction lastVal et informations de débogage optimisées",
                "it": "problema getGuests risolto, funzione lastVal e informazioni di debug ottimizzate",
                "es": "Problema de getGuests resuelto, función lastVal e información de depuración optimizada",
                "pl": "problem getGuests rozwiązany, funkcja lastVal i zoptymalizowane informacje debugowania",
                "zh-cn": "解决了getGuests问题，优化了lastVal函数和调试信息"
            },
            "0.2.0": {
                "en": "debug and error information optimized, crypto dependency removed, service check and blacklist added",
                "de": "Debug- und Fehlerinformationen optimiert, Kryptoabhängigkeit entfernt, Service-Check und Blacklist hinzugefügt",
                "ru": "оптимизирована информация об отладке и ошибках, удалена крипто-зависимость, добавлена проверка сервиса и черный список",
                "pt": "informações de depuração e erro otimizadas, dependência de criptografia removida, verificação de serviço e lista negra adicionada",
                "nl": "foutopsporing en foutinformatie geoptimaliseerd, crypto-afhankelijkheid verwijderd, servicecontrole en zwarte lijst toegevoegd",
                "fr": "informations de débogage et d'erreur optimisées, suppression de la dépendance cryptographique, vérification du service et liste noire ajoutées",
                "it": "informazioni di debug ed errori ottimizzate, dipendenza da crittografia rimossa, controllo del servizio e lista nera aggiunti",
                "es": "información de error y depuración optimizada, dependencia de criptografía eliminada, verificación de servicio y lista negra añadida",
                "pl": "zoptymalizowano informacje o debugowaniu i błędach, usunięto zależność kryptograficzną, dodano kontrolę usługi i czarną listę",
                "zh-cn": "优化了调试和错误信息，删除了加密依赖性，添加了服务检查和黑名单"
            },
            "0.1.0": {
                "en": "Influxdb added, debug information added",
                "de": "Influxdb hinzugefügt, Debug-Informationen hinzugefügt",
                "ru": "Добавлен Influxdb, добавлена отладочная информация",
                "pt": "Influxdb adicionado, informações de depuração adicionadas",
                "nl": "Influxdb toegevoegd, foutopsporingsinformatie toegevoegd",
                "fr": "Influxdb ajouté, informations de débogage ajoutées",
                "it": "Influxdb aggiunto, informazioni di debug aggiunte",
                "es": "Influxdb agregado, información de depuración agregada",
                "pl": "Dodano Influxdb, dodano informacje debugowania",
                "zh-cn": "添加了Influxdb，添加了调试信息"
            },
            "0.0.7": {
                "en": "invalid date bug resolved. Debug information added. Default values from Date objects changed.",
                "de": "Fehler mit ungültigem Datum behoben. Debug-Informationen hinzugefügt. Standardwerte von Datumsobjekten geändert.",
                "ru": "недопустимая ошибка даты устранена. Добавлена отладочная информация. Значения по умолчанию для объектов Date изменены.",
                "pt": "erro de data inválido resolvido. Informações de depuração adicionadas. Os valores padrão dos objetos Date foram alterados.",
                "nl": "ongeldige datum bug opgelost. Foutopsporingsinformatie toegevoegd. Standaardwaarden van objecten Date zijn gewijzigd.",
                "fr": "bug de date invalide résolu. Informations de débogage ajoutées. Les valeurs par défaut des objets Date ont été modifiées.",
                "it": "bug data non valido risolto. Aggiunte informazioni di debug. Valori predefiniti dagli oggetti Data modificati.",
                "es": "error de fecha inválido resuelto. Información de depuración añadida. Los valores predeterminados de los objetos de fecha cambiaron.",
                "pl": "błąd nieprawidłowej daty rozwiązany. Dodano informacje debugowania. Wartości domyślne z obiektów Data uległy zmianie.",
                "zh-cn": "解决了无效的日期错误。添加了调试信息。 Date对象的默认值已更改。"
            },
            "0.0.6": {
                "en": "bug in json and html table resolved",
                "de": "Fehler in JSON- und HTML-Tabelle behoben",
                "ru": "исправлена ошибка в json и html таблицах",
                "pt": "bug na tabela json e html resolvida",
                "nl": "fout in json en html-tabel opgelost",
                "fr": "bug dans la table json et html résolu",
                "it": "bug risolto nella tabella json e html",
                "es": "error en la tabla json y html resuelto",
                "pl": "błąd w tabeli json i html rozwiązany",
                "zh-cn": "json和html表中的错误已解决"
            },
            "0.0.5": {
                "en": "configuration optimized",
                "de": "Konfiguration optimiert",
                "ru": "оптимизированная конфигурация",
                "pt": "configuração otimizada",
                "nl": "configuratie geoptimaliseerd",
                "fr": "configuration optimisée",
                "it": "configurazione ottimizzata",
                "es": "configuración optimizada",
                "pl": "zoptymalizowana konfiguracja",
                "zh-cn": "配置优化"
            },
            "0.0.4": {
                "en": "calculation error resolved",
                "de": "Rechenfehler behoben",
                "ru": "ошибка расчета устранена",
                "pt": "erro de cálculo resolvido",
                "nl": "berekeningsfout opgelost",
                "fr": "erreur de calcul résolue",
                "it": "errore di calcolo risolto",
                "es": "error de cálculo resuelto",
                "pl": "błąd obliczeniowy rozwiązany",
                "zh-cn": "计算错误已解决"
            },
            "0.0.3": {
                "en": "guest feature added",
                "de": "Gast-Feature hinzugefügt",
                "ru": "добавлена функция гостя",
                "pt": "recurso convidado adicionado",
                "nl": "gastfunctie toegevoegd",
                "fr": "fonctionnalité invité ajoutée",
                "it": "funzione ospite aggiunta",
                "es": "función de invitado agregada",
                "pl": "dodano funkcję gościa",
                "zh-cn": "访客功能已添加"
            },
            "0.0.2": {
                "en": "optimized features",
                "de": "optimierte Funktionen",
                "ru": "оптимизированные функции",
                "pt": "recursos otimizados",
                "nl": "geoptimaliseerde functies",
                "fr": "fonctionnalités optimisées",
                "it": "caratteristiche ottimizzate",
                "es": "características optimizadas",
                "pl": "zoptymalizowane funkcje",
                "zh-cn": "优化功能"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "Fritzbox CheckPresence",
        "titleLang": {
            "en": "Fritzbox CheckPresence",
            "de": "Fritzbox CheckPresence",
            "ru": "Fritzbox CheckPresence",
            "pt": "Fritzbox CheckPresence",
            "nl": "Fritzbox CheckPresence",
            "fr": "Fritzbox CheckPresence",
            "it": "Fritzbox CheckPresence",
            "es": "Fritzbox CheckPresence",
            "pl": "Fritzbox CheckPresence",
            "zh-cn": "Fritzbox CheckPresence"
        },
        "desc": {
            "en": "The adapter checks the presence of family members over the fritzbox. You must fill in the name of the family member and the mac-address of the used device. The comment is optional and you can enable or disable the family member. The datapoint based on the member name.",
            "de": "Der Adapter prüft die Anwesenheit von Familienmitgliedern über die Fritzbox. ",
            "ru": "Адаптер проверяет присутствие членов семьи через fritzbox. ",
            "pt": "O adaptador verifica a presença de membros da família sobre o fritzbox. ",
            "nl": "De adapter controleert de aanwezigheid van familieleden via de fritzbox. ",
            "fr": "L'adaptateur vérifie la présence de membres de la famille sur la fritzbox. ",
            "it": "L'adattatore controlla la presenza dei membri della famiglia sul fritzbox. ",
            "es": "El adaptador comprueba la presencia de miembros de la familia sobre el fritzbox. ",
            "pl": "Adapter sprawdza obecność członków rodziny na fritzbox. ",
            "zh-cn": "适配器通过fritzbox检查家庭成员的存在。"
        },
        "authors": [
            "Achim Fürhoff <achim.fuerhoff@outlook.de>"
        ],
        "keywords": [
            "ioBroker",
            "presence",
            "family",
            "tr064",
            "fritz.box",
            "fritzbox"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "fb-checkpresence.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/afuerhoff/ioBroker.fb-checkpresence/master/admin/fb-checkpresence.png",
        "readme": "https://github.com/afuerhoff/ioBroker.fb-checkpresence/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "infrastructure",
        "connectionType": "local",
        "dataSource": "poll",
        "compact": true,
        "materialize": true,
        "messagebox": true,
        "dependencies": [
            {
                "admin": ">=3.0.0"
            }
        ]
    },
    "native": {
        "familymembers": [],
        "whitelist": [],
        "ipaddress": "fritz.box",
        "interval": 1,
        "history": "",
        "dateformat": "yyyy.mm.dd HH:MM:ss",
        "username": "",
        "password": ""
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        }
    ]
}